# Basic Data Exploration

This notebook demonstrates a simple workflow using a small, in-memory sample dataset created directly in the notebook (no external files).

It builds a DataFrame with pandas, shows a quick preview and summary, and creates a simple plot.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

# Create a small in-memory dataset (no files)
names = ['Alice', 'Bob', 'Charlie', 'Diana', 'Eric']
cities = ['New York', 'San Francisco', 'Chicago', 'Seattle', 'Austin']
ages = [29, 35, 42, 31, 26]
salaries = [85000, 120000, 95000, 99000, 72000]

df = pd.DataFrame({
    'id': range(1, 6),
    'name': names,
    'age': ages,
    'city': cities,
    'salary': salaries,
})
df.head()

   id     name  age           city  salary
0   1    Alice   29       New York   85000
1   2      Bob   35  San Francisco  120000
2   3  Charlie   42        Chicago   95000
3   4    Diana   31        Seattle   99000
4   5     Eric   26         Austin   72000